## SQL: Window functions

In [1]:
from sqlalchemy import create_engine, text
import pandas as pd
import os
import gc

In [2]:
engine = create_engine("mysql+mysqlconnector://root:abc@127.0.0.1:3306/cs639")
conn = engine.connect()

In [3]:
list(conn.execute(text("show tables;")))

[('name_basics',),
 ('title_akas',),
 ('title_basics',),
 ('title_crew',),
 ('title_episode',),
 ('title_principals',),
 ('title_ratings',)]

### IMDB dataset

- Source: https://datasets.imdbws.com/ 
- Original dataset is too large to be analyzed using our current VM
- Schema information: https://developer.imdb.com/non-commercial-datasets/

In [4]:
!wget https://ms.sites.cs.wisc.edu/cs639/data/IMDB.zip

--2025-02-12 17:58:03--  https://ms.sites.cs.wisc.edu/cs639/data/IMDB.zip
18.160.200.78, 18.160.200.56, 18.160.200.50, ....edu)...
Connecting to ms.sites.cs.wisc.edu (ms.sites.cs.wisc.edu)|18.160.200.78|:443... connected.
200 OKequest sent, awaiting response...
Length: 584293 (571K) [application/zip]
Saving to: ‘IMDB.zip’

IMDB.zip            100%[===================>] 570.60K  --.-KB/s    in 0.05s

2025-02-12 17:58:03 (12.2 MB/s) - ‘IMDB.zip’ saved [584293/584293]

In [5]:
!unzip IMDB.zip

Archive:  IMDB.zip
  inflating: name.basics.tsv
  inflating: title.akas.tsv
  inflating: title.basics.tsv
  inflating: title.crew.tsv
  inflating: title.episode.tsv
  inflating: title.principals.tsv
  inflating: title.ratings.tsv

#### Populating MySQL server with tables corresponding to all tsv files

In [6]:
files = os.listdir()
tsv_files = [f for f in files if ".tsv" in f]
table_names = [f.replace(".tsv", "") for f in tsv_files]
table_names = [f.replace(".", "_") for f in table_names]

In [7]:
for idx, tsv_file in enumerate(tsv_files):
    df = pd.read_csv(tsv_file, sep="\t", na_values='\\N')
    df.to_sql(table_names[idx], conn, index=False, if_exists="replace")
    print(f"Populated {table_names[idx]}")

Populated title_basics
Populated title_principals
Populated title_akas
Populated name_basics
Populated title_episode
Populated title_ratings
Populated title_crew

In [8]:
list(conn.execute(text("show tables;")))

[('name_basics',),
 ('title_akas',),
 ('title_basics',),
 ('title_crew',),
 ('title_episode',),
 ('title_principals',),
 ('title_ratings',)]

### Data Analysis

### Window functions aka Analytic Functions aka Online Analytical Processing (OLAP) functions 

- What are window functions?
    - Special types of functions that perform calculations across a set of table rows that are related to the current row.
    - Unlike aggregate functions, window functions do not collapse the result set into a single row or group of rows. Instead, they provide a result for each row while still considering a "window" of other rows.

### Clauses

- `OVER`: defines the window or partition over which the function operates.
- `ORDER BY`: Specifies the order in which rows should be processed within each window.
- `PARTITION BY`: divides the result set into partitions to apply the function to each partition separately.

### Ranking functions

- `RANK`
    - returns same ranking in case of a tie, with gaps in the rankings
    - why are there gaps? because rank assigned after a tie skips over the subsequent positions, resulting in a gap
- `DENSE_RANK`:
    - returns the same ranking as `RANK` with no gaps in the rankings
- `ROW_NUMBER`:
    - returns unique number for each row with rankings arbitrarily assigned in case of a tie
    - ordering requirements can help you break ties and come up with predictable numbering

#### Q1: Rank all titlesIDs by their rating (descending order).

In [9]:
pd.read_sql("""
    SELECT 
        tconst, averageRating, 
        RANK() OVER (ORDER BY averageRating DESC) AS titleRank
    FROM title_ratings
""", conn)

         tconst  averageRating  titleRank
0     tt2924058           10.0          1
1     tt1841655            9.8          2
2    tt12601448            9.6          3
3     tt4065164            9.5          4
4     tt4740328            9.5          4
..          ...            ...        ...
384   tt5188300            3.2        383
385  tt18257696            2.9        386
386   tt6840238            2.8        387
387   tt0933342            2.7        388
388   tt4175544            1.0        389

[389 rows x 3 columns]

#### Q2: Rank all titles by their rating (descending order).

In [10]:
pd.read_sql("""
    SELECT 
        b.tconst, b.primaryTitle, 
        r.averageRating, 
        RANK() OVER (ORDER BY r.averageRating DESC) AS titleRank
    FROM title_ratings r
    JOIN title_basics b ON r.tconst = b.tconst
    LIMIT 15
""", conn)

        tconst           primaryTitle  averageRating  titleRank
0    tt2924058           Episode #9.2           10.0          1
1    tt1841655             In the Bin            9.8          2
2   tt12601448             Episode 11            9.6          3
3    tt4065164           All Shook Up            9.5          4
4    tt4740328   Lavanya fires Khushi            9.5          4
5    tt7385060  A Premature Christmas            9.5          4
6    tt2271562           Episode #1.6            9.4          7
7   tt23901758      The Mountain Path            9.4          7
8   tt29208392               Postmord            9.3          9
9   tt30835366       Learning English            9.3          9
10   tt0698358               La bicha            9.2         11
11  tt13677184        Feliz Ano Novo!            9.2         11
12  tt27749874  Shoeless in the Woods            9.2         11
13   tt5316184           Episode #1.9            9.2         11
14  tt18339386             2nd Chance            9.1         15

#### Q3: Dense rank all titles by their rating (descending order).

In [11]:
pd.read_sql("""
    SELECT 
        b.tconst, b.primaryTitle, 
        r.averageRating, 
        DENSE_RANK() OVER (ORDER BY r.averageRating DESC) AS titleDenseRank
    FROM title_ratings r
    JOIN title_basics b ON r.tconst = b.tconst
    LIMIT 15
""", conn)

        tconst           primaryTitle  averageRating  titleDenseRank
0    tt2924058           Episode #9.2           10.0               1
1    tt1841655             In the Bin            9.8               2
2   tt12601448             Episode 11            9.6               3
3    tt4065164           All Shook Up            9.5               4
4    tt4740328   Lavanya fires Khushi            9.5               4
5    tt7385060  A Premature Christmas            9.5               4
6    tt2271562           Episode #1.6            9.4               5
7   tt23901758      The Mountain Path            9.4               5
8   tt29208392               Postmord            9.3               6
9   tt30835366       Learning English            9.3               6
10   tt0698358               La bicha            9.2               7
11  tt13677184        Feliz Ano Novo!            9.2               7
12  tt27749874  Shoeless in the Woods            9.2               7
13   tt5316184           Episode #1.9            9.2               7
14  tt18339386             2nd Chance            9.1               8

#### Q4: Assign a sequential rank to each title by rating (descending order). If there are ties in ratings, break ties based on ascending order of titles.

In [12]:
pd.read_sql("""
    SELECT 
        b.tconst, b.primaryTitle, 
        r.averageRating, 
        ROW_NUMBER() OVER (ORDER BY r.averageRating DESC, primaryTitle ASC) AS titleUniqueRank
    FROM title_ratings r
    JOIN title_basics b ON r.tconst = b.tconst
    LIMIT 15
""", conn)

        tconst           primaryTitle  averageRating  titleUniqueRank
0    tt2924058           Episode #9.2           10.0                1
1    tt1841655             In the Bin            9.8                2
2   tt12601448             Episode 11            9.6                3
3    tt7385060  A Premature Christmas            9.5                4
4    tt4065164           All Shook Up            9.5                5
5    tt4740328   Lavanya fires Khushi            9.5                6
6    tt2271562           Episode #1.6            9.4                7
7   tt23901758      The Mountain Path            9.4                8
8   tt30835366       Learning English            9.3                9
9   tt29208392               Postmord            9.3               10
10   tt5316184           Episode #1.9            9.2               11
11  tt13677184        Feliz Ano Novo!            9.2               12
12   tt0698358               La bicha            9.2               13
13  tt27749874  Shoeless in the Woods            9.2               14
14  tt18339386             2nd Chance            9.1               15

### `PARTITION BY`

- divides the result set into subsets or partitions, based on one or more columns and performs calculations separately for each partition
- similar to a `GROUP BY` clause, but `PARTITION BY` does not collapse rows into a single result
- Use case scenarios:
    - ranking within groups

#### Q5: Rank all titles by their rating (descending order) within each genre.

In [13]:
pd.read_sql("""
    SELECT 
        b.tconst, b.primaryTitle, b.genres,r.averageRating, 
        ROW_NUMBER() OVER (PARTITION BY b.genres ORDER BY r.averageRating DESC) AS genreRanking
    FROM title_ratings r
    JOIN title_basics b ON r.tconst = b.tconst
    WHERE b.genres IS NOT NULL
""", conn)

,tconst,primaryTitle,genres,averageRating,genreRanking
0,tt5316184,Episode #1.9,Action,9.2,1
1,tt27946257,Yongchun of South Shaolin: Breakthrough,Action,8.1,2
2,tt28114581,Tebus the Movie,Action,7.4,3
3,tt0892322,Lumines II,Action,7.3,4
4,tt0318498,Ninja in the Killing Fields,Action,3.8,5
...,...,...,...,...,...
380,tt0556591,Death Ride,Western,8.6,1
381,tt0631931,Truth About Gunfighting,Western,7.6,2
382,tt0038874,Red River Renegades,Western,6.6,3
383,tt0037142,Oath of Vengeance,Western,5.7,4
384,tt0017504,Unseen Enemies,Western,4.8,5

### Aggregate functions with window functions

`SUM`, `AVG`, `COUNT`, `MIN`, `MAX`

#### Q6: Rank all titles by total number of ratings (descending order) for each title. If there are ties in ratings, break ties based on ascending order of titles.

In [14]:
pd.read_sql("""
    SELECT 
        b.tconst, b.primaryTitle, 
        SUM(r.numVotes) AS totalRatings,
        RANK() OVER (ORDER BY SUM(r.numVotes) DESC, primaryTitle ASC) AS rating_rank
    FROM title_basics b
    JOIN title_ratings r ON b.tconst = r.tconst
    GROUP BY b.tconst, b.primaryTitle
""", conn)

         tconst                        primaryTitle  totalRatings  rating_rank
0     tt2305051                                Wild      140750.0            1
1     tt0067065  Escape from the Planet of the Apes       41883.0            2
2    tt13659418                         Pam & Tommy       40732.0            3
3     tt6294706                             The Chi        8463.0            4
4     tt0060897                 Return of the Seven        4931.0            5
..          ...                                 ...           ...          ...
384   tt4175544                      Reem Halloween           5.0          385
385  tt27749874               Shoeless in the Woods           5.0          386
386  tt23901758                   The Mountain Path           5.0          387
387   tt4041376                 Vampires & Hormones           5.0          388
388   tt5976978                        White Flight           5.0          389

[389 rows x 4 columns]

### Window Frames

### `ROWS UNBOUNDED PRECEDING`

- the window includes all rows before the current one, effectively creating a running total
- Use case scenarios:
    - running totals
    - moving average

#### Q7: Calculate the cumulative total of votes for each title over time (based on the startYear).

In [15]:
pd.read_sql("""
    SELECT * FROM title_ratings LIMIT 2
""", conn)

      tconst  averageRating  numVotes
0  tt0000912            4.3        73
1  tt0017504            4.8        27

In [16]:
pd.read_sql("""
    SELECT * FROM title_basics LIMIT 2
""", conn)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000912,short,The Indian Runner's Romance,The Indian Runner's Romance,0,1909.0,None,11.0,"Short,Western"
1,tt0013001,short,The Cashier,The Cashier,0,1922.0,None,NaN,"Animation,Comedy,Short"

In [17]:
pd.read_sql("""
    SELECT 
        b.tconst, b.primaryTitle, b.startYear, r.numVotes,
        SUM(r.numVotes) OVER (ORDER BY b.startYear ROWS UNBOUNDED PRECEDING) AS cumulativeVotes
    FROM title_basics b
    JOIN title_ratings r ON b.tconst = r.tconst
    ORDER BY b.startYear
""", conn)

,tconst,primaryTitle,startYear,numVotes,cumulativeVotes
0,tt0345326,Genève (Exposition 1896): rentrée à l'étable,1896.0,202,202.0
1,tt0000912,The Indian Runner's Romance,1909.0,73,275.0
2,tt0017504,Unseen Enemies,1925.0,27,302.0
3,tt0024996,Coming Out Party,1934.0,66,368.0
4,tt0029553,The Sheik Steps Out,1937.0,45,413.0
...,...,...,...,...,...
384,tt30869520,Building the World of Pandora,2023.0,5,308133.0
385,tt16311360,Krzyk: Losing Control,2024.0,7,308140.0
386,tt30835366,Learning English,2024.0,12,308152.0
387,tt30997053,"Abydos High School, Abydos Foreclosure Task Force",2024.0,79,308231.0
388,tt31458419,Cheese All That Adventure,2024.0,90,308321.0

### `ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING`

- the window includes current row, previous row (`1 PRECEDING`), and next row (`1 FOLLOWING`)
- for the first row, window includes just first row and second (because of non-existence of previous row)
- similarly, for the last row, window includes the penultimate row and the last row

#### Q8: Calculate the average rating of each movie, including the ratings of the previous and next movies based on their release year (ascending).

In [18]:
pd.read_sql("""
    SELECT b.primaryTitle, b.startYear, r.averageRating,
    AVG(r.averageRating) OVER (ORDER BY startYear ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING) AS avg_rating_including_neighbors
    FROM title_basics b
    JOIN title_ratings r ON b.tconst = r.tconst
""", conn)

,primaryTitle,startYear,averageRating,avg_rating_including_neighbors
0,Genève (Exposition 1896): rentrée à l'étable,1896.0,5.2,4.750000
1,The Indian Runner's Romance,1909.0,4.3,4.766667
2,Unseen Enemies,1925.0,4.8,5.000000
3,Coming Out Party,1934.0,5.9,5.566667
4,The Sheik Steps Out,1937.0,6.0,6.033333
...,...,...,...,...
384,Building the World of Pandora,2023.0,7.0,7.233333
385,Krzyk: Losing Control,2024.0,6.9,7.733333
386,Learning English,2024.0,9.3,7.400000
387,"Abydos High School, Abydos Foreclosure Task Force",2024.0,6.0,7.433333
388,Cheese All That Adventure,2024.0,7.0,6.500000

### `RANGE BETWEEN INTERVAL <N> DAY PRECEDING AND INTERVAL <N> DAY FOLLOWING`

- typically used for columns with `DATE`, or `DATETIME`, or `TIMESTAMP` types

#### Q9: Calculate the total number of votes each movie received, including votes from movies released in the 3 days before and after the release date of each movie.

Let's first explore the title_basics table schema.

In [19]:
pd.read_sql("SHOW COLUMNS FROM title_basics", conn)

            Field    Type Null Key Default Extra
0          tconst    text  YES        None
1       titleType    text  YES        None
2    primaryTitle    text  YES        None
3   originalTitle    text  YES        None
4         isAdult  bigint  YES        None
5       startYear  double  YES        None
6         endYear  double  YES        None
7  runtimeMinutes  double  YES        None
8          genres    text  YES        None

In [20]:
pd.read_sql("DESCRIBE title_basics", conn)

            Field    Type Null Key Default Extra
0          tconst    text  YES        None
1       titleType    text  YES        None
2    primaryTitle    text  YES        None
3   originalTitle    text  YES        None
4         isAdult  bigint  YES        None
5       startYear  double  YES        None
6         endYear  double  YES        None
7  runtimeMinutes  double  YES        None
8          genres    text  YES        None

In [21]:
pd.read_sql("""
    SELECT 
        b.primaryTitle,
        b.startYear,
        STR_TO_DATE(
            CONCAT(CAST(b.startYear AS UNSIGNED), '-01-01'), '%Y-%m-%d'
        ) AS releaseDate,
        r.numVotes,
        SUM(r.numVotes) OVER (
            ORDER BY STR_TO_DATE(CONCAT(CAST(b.startYear AS UNSIGNED), '-01-01'), '%Y-%m-%d') 
            ROWS BETWEEN 3 PRECEDING AND 3 FOLLOWING
        ) AS totalVotes
    FROM title_basics b
    JOIN title_ratings r ON b.tconst = r.tconst
    LIMIT 10
""", conn)

,primaryTitle,startYear,releaseDate,numVotes,totalVotes
0,Genève (Exposition 1896): rentrée à l'étable,1896.0,1896-01-01,202,368.0
1,The Indian Runner's Romance,1909.0,1909-01-01,73,413.0
2,Unseen Enemies,1925.0,1925-01-01,27,494.0
3,Coming Out Party,1934.0,1934-01-01,66,511.0
4,The Sheik Steps Out,1937.0,1937-01-01,45,2319.0
5,Music Made Simple,1938.0,1938-01-01,81,2435.0
6,Happy Circus Days,1942.0,1942-01-01,17,2438.0
7,The Fallen Sparrow,1943.0,1943-01-01,2010,2418.0
8,Oath of Vengeance,1944.0,1944-01-01,189,3157.0
9,L'île d'amour,1944.0,1944-01-01,30,3111.0

### `LAG` and `LEAD`

- `LAG` allows you to access data from a previous row within the same result set
- `LEAD` allows you to access data from the next row in the result set

#### Q10: What is the number of votes for each title compared to the previous title released in the same year?

In [22]:
pd.read_sql("""
    SELECT 
        b.tconst, b.primaryTitle,
        b.startYear, r.numVotes,
        LAG(r.numVotes) OVER (PARTITION BY b.startYear ORDER BY b.startYear) AS previousVotes
    FROM title_basics b
    JOIN title_ratings r ON b.tconst = r.tconst
    ORDER BY b.startYear
""", conn)

,tconst,primaryTitle,startYear,numVotes,previousVotes
0,tt0345326,Genève (Exposition 1896): rentrée à l'étable,1896.0,202,NaN
1,tt0000912,The Indian Runner's Romance,1909.0,73,NaN
2,tt0017504,Unseen Enemies,1925.0,27,NaN
3,tt0024996,Coming Out Party,1934.0,66,NaN
4,tt0029553,The Sheik Steps Out,1937.0,45,NaN
...,...,...,...,...,...
384,tt30869520,Building the World of Pandora,2023.0,5,10.0
385,tt16311360,Krzyk: Losing Control,2024.0,7,NaN
386,tt30835366,Learning English,2024.0,12,7.0
387,tt30997053,"Abydos High School, Abydos Foreclosure Task Force",2024.0,79,12.0
388,tt31458419,Cheese All That Adventure,2024.0,90,79.0

What if you want to filter out rows where `previousVotes` is `NULL`?

### Common Table Expression (CTE)

- temporary result set that you can reference within a SQL query
- defined using the `WITH` clause
- CTEs are only visible to the SQL statement that immediately follows them
- benefits: modularity, reusability

In [23]:
pd.read_sql("""
    WITH VotesCTE AS (
        SELECT 
            b.tconst, b.primaryTitle,
            b.startYear, r.numVotes,
            LAG(r.numVotes) OVER (PARTITION BY b.startYear ORDER BY b.startYear) AS previousVotes
        FROM title_basics b
        JOIN title_ratings r ON b.tconst = r.tconst
        ORDER BY b.startYear
    )
    
    SELECT *
    FROM VotesCTE
    WHERE previousVotes IS NOT NULL
""", conn)

,tconst,primaryTitle,startYear,numVotes,previousVotes
0,tt0179003,L'île d'amour,1944.0,30,189
1,tt0043124,West of Wyoming,1950.0,35,784
2,tt0167882,The Assassination of Matteotti,1956.0,8,2286
3,tt0182719,Annie Get Your Gun,1957.0,118,50
4,tt0870224,A Cruise for Harriet,1958.0,30,41
...,...,...,...,...,...
311,tt30145200,Khud Khushi,2023.0,10,11
312,tt30869520,Building the World of Pandora,2023.0,5,10
313,tt30835366,Learning English,2024.0,12,7
314,tt30997053,"Abydos High School, Abydos Foreclosure Task Force",2024.0,79,12
315,tt31458419,Cheese All That Adventure,2024.0,90,79

#### Q11: What is the number of votes for each title compared to the next title released in the same year?

In [24]:
pd.read_sql("""
    SELECT 
        b.tconst, b.primaryTitle,
        b.startYear, r.numVotes,
        LEAD(r.numVotes) OVER (PARTITION BY b.startYear ORDER BY b.startYear) AS previousVotes
    FROM title_basics b
    JOIN title_ratings r ON b.tconst = r.tconst
    ORDER BY b.startYear
""", conn)

,tconst,primaryTitle,startYear,numVotes,previousVotes
0,tt0345326,Genève (Exposition 1896): rentrée à l'étable,1896.0,202,NaN
1,tt0000912,The Indian Runner's Romance,1909.0,73,NaN
2,tt0017504,Unseen Enemies,1925.0,27,NaN
3,tt0024996,Coming Out Party,1934.0,66,NaN
4,tt0029553,The Sheik Steps Out,1937.0,45,NaN
...,...,...,...,...,...
384,tt30869520,Building the World of Pandora,2023.0,5,NaN
385,tt16311360,Krzyk: Losing Control,2024.0,7,12.0
386,tt30835366,Learning English,2024.0,12,79.0
387,tt30997053,"Abydos High School, Abydos Foreclosure Task Force",2024.0,79,90.0
388,tt31458419,Cheese All That Adventure,2024.0,90,NaN